app/controllers/api/feeds_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" = $1  [["feed_id", 1]]
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    render :json => Feed.find(params[:id]).as_json(methods: :latest_entries)

SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "feeds" WHERE "feeds"."id" = $1  [["id", 1]]
---
  def destroy
    feed = Feed.find(params[:id])
    feed.destroy